{
    "Introduction to AI": "Modul ini merupakan fondasi awal untuk memahami dunia Kecerdasan Buatan (AI). Anda akan dikenalkan pada pengertian AI, sejarah perkembangan, serta peran pentingnya dalam kehidupan modern. Selain itu, Anda juga akan memahami konsep agen sebagai bagian penting dalam sistem AI.\nMateri yang akan dipelajari:\n- Apa itu AI?\n- Mengapa AI penting?\n- Aplikasi AI\n- Konsep agen dalam AI",
    "Heuristic Search": "Modul ini memperkenalkan teknik pencarian heuristik dalam AI yang bertujuan untuk menemukan solusi secara efisien tanpa harus menjelajahi seluruh ruang kemungkinan. Pencarian heuristik banyak digunakan dalam perencanaan, permainan, dan navigasi cerdas. Anda akan mempelajari berbagai algoritma populer yang mengandalkan penilaian heuristik dalam pencarian.\nMateri yang akan dipelajari:\n- Backtracking\n- Hill Climbing\n- Greedy Best-First Search\n- A*\n- Simulated Annealing",
    "Genetic Algorithm and Nature Inspired Algorithms": "Modul ini mengeksplorasi pendekatan penyelesaian masalah yang terinspirasi dari proses-proses alami seperti evolusi dan perilaku kelompok. Metode-metode ini sangat berguna dalam menyelesaikan masalah optimasi yang kompleks dan tidak memiliki solusi pasti. Anda akan memahami bagaimana populasi solusi berkembang melalui iterasi dan interaksi antar agen.\nMateri yang akan dipelajari:\n- Genetic Algorithm\n- Evolutionary Strategy\n- Ant Colony Optimization (ACO)\n- Particle Swarm Optimization (PSO)",
    "Rule based AI and Fuzzy Logic": "Modul ini membahas pendekatan pengambilan keputusan menggunakan sistem berbasis aturan dan logika fuzzy. Pendekatan ini cocok digunakan saat data yang tersedia bersifat ambigu atau tidak pasti. Anda akan memahami bagaimana aturan-aturan IF-THEN serta tingkat keanggotaan fuzzy digunakan dalam pengambilan keputusan cerdas.\nMateri yang akan dipelajari:\n- Rule-Based System\n- Fuzzy Logic",
    "Machine Learning": "Modul ini adalah pengantar pembelajaran mesin (machine learning), di mana Anda akan memahami bagaimana mesin dapat belajar dari data tanpa diprogram secara eksplisit. Konsep dasar machine learning akan dibahas sebagai jembatan menuju pemahaman yang lebih mendalam pada modul berikutnya.\nMateri yang akan dipelajari:\n- Pengantar Machine Learning",
    "Supervised, Unsupervised and Reinforcement Learning": "Modul ini mendalami tiga pendekatan utama dalam machine learning: pembelajaran terawasi, tak terawasi, dan pembelajaran penguatan. Anda akan mempelajari berbagai teknik dalam klasifikasi, clustering, serta agen yang belajar melalui interaksi dan umpan balik dari lingkungan. Modul ini menjadi landasan penting dalam memahami cara sistem cerdas belajar dari pengalaman.\nMateri yang akan dipelajari:\n- K-NN classifier & regressor\n- Gradient Descent\n- K-Means\n- DBScan\n- Q-Learning",
    "Ensemble of Machine Learning": "Modul ini memperkenalkan pendekatan ensemble, yaitu metode yang menggabungkan beberapa model pembelajaran mesin untuk menghasilkan prediksi yang lebih akurat dan stabil. Teknik ini digunakan untuk meningkatkan kinerja model dan mengurangi risiko kesalahan dari model tunggal.\nMateri yang akan dipelajari:\n- Bagging\n- Boosting\n- Random Forest",
    "Neural Network, Deep Learning, and Generative AI": "Modul ini membahas deep learning, cabang machine learning yang menggunakan jaringan saraf dalam (deep neural networks) untuk memahami pola kompleks dalam data. Anda juga akan diperkenalkan pada konsep AI generatif, yang memungkinkan mesin menciptakan konten baru berdasarkan data yang telah dipelajari sebelumnya. Modul ini juga mengupas teknik pelatihan jaringan saraf seperti backpropagation yang menjadi inti dari pembelajaran mendalam.\nMateri yang akan dipelajari:\n- Perceptron\n- MLP (Multi-Layer Perceptron)\n- Backpropagation\n- Self-Organizing Map (SOM)\n- CNN (Convolutional Neural Network)\n- RNN (Recurrent Neural Network)\n- LSTM (Long Short-Term Memory)\n- Pengantar AI Generatif"
}
